# สำหรับข้อมูลแต่ละบรรทัดที่ประกอบด้วยเลขจำนวนเต็มบวกไม่น้อยกว่า 2 จำนวน
# โดยจะมีจำนวนที่น้อยที่สุดและจำนวนที่มากที่สุดอยู่เสมอ
# ให้นิสิตเขียนโปรแกรมเพื่อหาผลรวมของเลขจำนวนเต็มบวกที่หายไปในแต่ละบรรทัด
# ข้อมูลเข้า
# บรรทัดแรก เป็นจำนวนชุดทดสอบ N ชุด
# N บรรทัดต่อมา แต่ละบรรทัดเป็นข้อมูลในแต่ละชุดทดสอบ ซึ่งแต่ละชุดทดสอบจะประกอบด้วยเลขจำนวนเต็มบวกไม่น้อยกว่า 2 จำนวน คั่นแต่ละเลขด้วยเครื่องหมาย comma (,)
# ข้อมูลออก
# มี N บรรทัด แต่ละบรรทัดแสดงผลรวมของเลขที่หายไปในแต่ละชุดทดสอบตามลำดับ
# ตัวอย่างข้อมูลออก/ข้อมูลออก
# ข้อมูลเข้า	ข้อมูลออก	คำอธิบาย
# 2
# 7,8,4,9,6,2
# 14,13,16,10
                
# 8
# 38
                
# ชุดทดสอบมี 2 ชุด
# ชุดแรก มีเลขที่น้อยสุดคือ 2 เลขที่มากสุดคือ 9 
# เลขจำนวนเต็มบวกที่หายไประหว่าง 2 ถึง 9 คือ 3 และ 5 โดย 3 + 5 = 8
# ชุดที่สอง มีเลขที่น้อยสุดคือ 10 เลขที่มากสุดคือ 16 
# เลขจำนวนเต็มบวกที่หายไประหว่าง 10 ถึง 16 คือ 11, 12 และ 15 ผลรวมคือ 38                     
                
# 3
# 112,115,120
# 789,783,780,787
# 76,75,73,77,74                    
                
# 697
# 4706
# 0
                
# ชุดทดสอบมี 3 ชุด
# ชุดแรก เลขจำนวนเต็มบวกที่หายไประหว่าง 112 ถึง 120 คือ 113, 114, 116, 117, 118, 119 
# ผลรวมของเลขที่หายไปคือ 697
# ชุดที่สอง เลขที่หายไประหว่าง 780 ถึง 789 คือ 781, 782, 784, 785, 786, 788 
# ผลรวมของเลขที่หายไปคือ 4706
# ชุดที่สาม ไม่มีเลขที่หายไประหว่าง 73 ถึง 77 
# ดังนั้นผลรวมของเลขที่หายไปคือ 0     

def coding():
    number = input()
    number = number.split(",")

    for i in range(len(number)):
        number[i] = int(number[i])

    maxNumber = max(number)
    minNumber = min(number)

    ls = []

    for i in range(minNumber, maxNumber + 1):
        ls.append(i)

    missing = []
    total = 0

    for i in ls:
        if i not in number:
            missing.append(i)

    for i in missing:
        total += i

    return total

n = int(input(""))
total = []
counter = 0

while True:
    if counter >= n:
        break

    total.append(coding())
    
    counter += 1

for i in total:
    print(i)