# หากถามว่าระหว่างข้อมูลส่วนตัวและความปลอดภัยนั้น สิ่งใดสำคัญกว่ากัน
# สำหรับนักวิทยาการคอมพิวเตอร์แล้ว การรักษาความปลอดภัยของข้อมูลส่วนตัวเป็นสิ่งที่ต้องคำนึงสูงสุด
# วิธีการหนึ่งของการรักษาความปลอดภัยของข้อมูล คือการเข้ารหัสข้อมูลให้ไม่สามารถถอดรหัสได้
# เพียงเพื่อใช้ในขั้นตอนการตรวจสอบข้อมูลว่าตรงกันเท่านั้น
# ในข้อนี้จะนำเสนอวิธีการเข้ารหัสแบบง่ายรูปแบบหนึ่ง โดยนำประโยคข้อความภาษาอังกฤษมาแบ่งเป็นคำ
# ซึ่งแต่ละคำจะแบ่งตามช่องว่างในประโยค แล้วนำตัวอักษรมาแปลงเป็นค่าแฮช (value) โดยคำนวณจาก

# value = (Alphabet Position) + (Position in Word)

# Alphabet Position คือลำดับของตัวอักษรภาษาอังกฤษ
# โดยให้ตัวอักษร A หรือ a มีค่า Alphabet Position เป็น 0,
# ตัวอักษร B หรือ b มีค่า Alphabet Position เป็น 1,
# ตัวอักษร C หรือ c มีค่า Alphabet Position เป็น 2
# เป็นเช่นนี้ไปเรื่อย ๆ จนกระทั่งถึงตัวอักษร Z หรือ z มีค่า Alphabet Position เป็น 25

# Position in Word คือตำแหน่งของตัวอักษรในคำ เริ่มจากตำแหน่ง 0 คือตัวอักษรตัวแรกของคำ

# ตัวอย่างค่าแฮชข้อความ "DATA HASH" คือ 66
# ได้จากผลรวมค่าแฮชของ D + A + T + A + H + A + S+ H = 3 + 1 + 21 + 3 + 7 + 1 + 20 + 10 = 66
# ซึ่งคำนวณดังนี้

# คำว่า DATA
#         D มีค่าแฮชเป็น 3 = 3 + 0        A (ตัวถัดจาก D) มีค่าแฮชเป็น 1 = 0 + 1
#         T มีค่าแฮชเป็น 21 = 19 + 2      A (ตัวสุดท้ายของคำว่า DATA) มีค่าแฮชเป็น 3 = 0 + 3
    
# คำว่า HASH
#         H (ตัวแรก) มีค่าแฮชเป็น 7 = 7 + 0   A (ตัวถัดจาก H) มีค่าแฮชเป็น 1 = 0 + 1
#         S มีค่าแฮชเป็น 20 = 18 + 2      H (ตัวสุดท้าย) มีค่าแฮชเป็น 10 = 7 + 3

    

# ให้นิสิตเขียนโปรแกรมเพื่อหาค่าแฮชของข้อความที่ต้องการเข้ารหัส
# ข้อมูลเข้า
# บรรทัดเดียว เป็นข้อความภาษาอังกฤษที่ต้องการเข้ารหัส ประกอบด้วยตัวอักษรหรือช่องว่างเท่านั้น ไม่มีตัวเลขหรืออักขระพิเศษ
# ข้อมูลออก
# ค่าแฮชที่ได้จากการเข้ารหัสข้อความตามวิธีข้างต้น
# ตัวอย่างข้อมูลออก/ข้อมูลออก
# ข้อมูลเข้า	ข้อมูลออก

                
# DATA HASH
                

            	
                
# 66
                

            

                
# privacy or security
                

            	
                
# 280
                

            

                
# z z z z z z
                

            	
                
# 150
                

            

                
# SLEEPY zzz ZZZ
                

            	
                
# 247

text = input()
text = text.lower()

text = text.split(" ")

total = 0

for t in text:
    for i in range(len(t)):
        hashy = (ord(t[i]) - 97) + i
        total += hashy

print(total)