# กำหนดภาพขนาด M * N พิกเซล ซึ่งหมายถึงภาพมีความกว้าง M พิกเซล (พิกเซลที่ 1 ถึง M) และมีความสูง N พิกเซล (แถวที่ 1 ถึง N)
# เมื่อคอมพิวเตอร์อ่านภาพจะได้ค่าสีในแต่ละพิกเซลของภาพ ตำแหน่งแต่ละพิกเซลจะถูกแทนด้วยคู่อันดับ (x, y)
# โดยภาพขนาด M * N จะมีตำแหน่งพิกเซลตั้งแต่ (1, 1) ถึง (M, N)

# สมมติให้ค่าสีถูกแทนที่ด้วยตัวอักขระต่าง ๆ ทั้งตัวอักษรภาษาอังกฤษ ตัวเลข หรืออักขระพิเศษ โดยอักขระที่เหมือนกัน หมายถึงสีเดียวกัน และสี A แตกต่างจากสี a

# ในโปรแกรมตกแต่งภาพจะมีอุปกรณ์เปลี่ยนสีของภาพที่คล้ายกับแปรงทาสี ซึ่งผู้ใช้โปรแกรมจะต้องเลือกสีใหม่ และขนาดของแปรงก่อนจะทาสีใหม่ไปบนพิกเซลของภาพ เพื่อเปลี่ยนสีของภาพใน “ตำแหน่งพิกเซลเป้าหมาย” ที่ต้องการ ในการใช้อุปกรณ์แปรงทาสี กำหนดให้ “ขอบเขตเป้าหมายของการเปลี่ยนสี” หมายถึง พื้นที่สี่เหลี่ยมจัตุรัสของพิกเซลที่นับจากตำแหน่งพิกเซลเป้าหมายไปทางซ้าย ขวา บน และล่าง ตามขนาดของแปรงทาสี เช่น ตำแหน่งพิกเซลเป้าหมายอยู่ที่ตำแหน่ง (3, 4) และใช้แปรงทาสีขนาด 2 ขอบเขตเป้าหมายของการเปลี่ยนสี คือตำแหน่งดังแสดงในตารางต่อไปนี้

# ขอบเขตเป้าหมายของการเปลี่ยนสี จะไม่เกินขอบเขตของภาพขนาด M * N พิกเซล

# ให้นิสิตเขียนโปรแกรมเพื่อเปลี่ยนสีของภาพด้วยอุปกรณ์แปรงทาสีชนิดพิเศษ ที่จะเปลี่ยนสีเฉพาะพิกเซลภายในขอบเขตเป้าหมายของการเปลี่ยนสี และมีสีเดียวกับสีในพิกเซลเป้าหมายที่ต้องการเปลี่ยนเท่านั้น
# ข้อมูลเข้า
# บรรทัดแรก เป็นขนาดของภาพ M*N พิกเซล
# เช่น 10*8 หมายถึงภาพมีความกว้าง M = 10 พิกเซล มีความสูง N = 8 พิกเซล มีพิกเซลตำแหน่ง (1, 1) ถึง (10, 8)

# บรรทัดที่ 2 ถึงบรรทัดที่ N + 1 แต่ละบรรทัด แทนค่าสีของพิกเซลแต่ละแถวในภาพ
# ค่าสีแทนด้วยอักขระใด ๆ ยกเว้นช่องว่าง อักขระที่ต่างกันแทนค่าสีที่ต่างกัน

# บรรทัดที่ N + 2 แทนตำแหน่งพิกเซลเป้าหมายที่ต้องการเปลี่ยนสี ขนาดของแปรงทาสี และสีที่ต้องการเปลี่ยนตามลำดับ
# เช่น 3 4 2 B หมายถึงพิกเซลเป้าหมายคือตำแหน่ง (3, 4) ต้องการเปลี่ยนสีด้วยแปรงทาสีขนาด 2 และเปลี่ยนสีของพิกเซลในขอบเขตเป้าหมายของการเปลี่ยนสีที่มีสีเหมือนกับสีในพิกเซลเป้าหมายให้เป็นสี B
# ข้อมูลออก
# มีจำนวน N บรรทัด แต่ละบรรทัดแสดงค่าสีของพิกเซลแต่ละแถวในภาพหลังจากเปลี่ยนสีด้วยแปรงทาสีชนิดพิเศษแล้ว
# ตัวอย่างข้อมูลออก/ข้อมูลออก
# ข้อมูลเข้า	ข้อมูลออก

                
# 10*8
# RRRRRrrrBB
# RRRRrrrrrB
# RRRRRrrrBB
# RRRRrrrBBB
# RRRRrrrBBB
# RRRrrrBBBB
# RRRrrrBBBB
# RRRRrrrBBB
# 3 4 2 B
                

            	
                
# RRRRRrrrBB
# BBBBrrrrrB
# BBBBBrrrBB
# BBBBrrrBBB
# BBBBrrrBBB
# BBBrrrBBBB
# RRRrrrBBBB
# RRRRrrrBBB
                

            

                
# 8*10
# BBBBBBBB
# BrBBBBBB
# rrrBBBBB
# rrrrrBBr
# rrrrrrrr
# RrRrrrrr
# RRRRRrrR
# RRRRRRRR
# RRRRRRRR
# RRRRRRRR
# 7 5 3 .
                

            	
                
# BBBBBBBB
# BrBBBBBB
# rrrBBBBB
# rrr..BB.
# rrr.....
# RrR.....
# RRRRR..R
# RRRRRRRR
# RRRRRRRR
# RRRRRRRR
                

            