# Histogram คือรูปหลายเหลี่ยมที่ประกอบด้วยลำดับของแท่งสี่เหลี่ยมผืนผ้าที่เรียงบนเส้นฐานเดียวกัน แท่งสี่เหลี่ยมแต่ละแท่งมีความกว้างเท่ากัน เท่ากับ 1 หน่วย แต่มีความสูงแตกต่างกัน ขึ้นกับค่าที่ต้องการแสดง

# เช่น รูปทางซ้ายแสดง Histogram ที่มีความสูง 2, 1, 4, 5, 1, 3, 3 หน่วย ตามลำดับ 

# โดยทั่วไปแล้ว Histogram ใช้แสดงการกระจายของข้อมูล เช่น ความถี่ของตัวอักษรในข้อความ สังเกตว่าลำดับของความสูงของแท่งใน Histogram ไม่มีการเรียงลำดับ

# ให้นิสิตเขียนโปรแกรมเพื่อคำนวณพื้นที่สี่เหลี่ยมผืนผ้าที่ใหญ่ที่สุดใน Histogram

# พื้นที่แรเงาในรูปทางขวาแสดงพื้นที่สี่เหลี่ยมผืนผ้าที่ใหญ่ที่สุดขนาด 4 * 2 = 8 ตารางหน่วย ของ Histogram ในรูปทางซ้าย
# ข้อมูลเข้า
# บรรทัดแรก เป็นจำนวนเต็มบวก N แทนจำนวนแท่งสี่เหลี่ยมของ Histogram
# N บรรทัดถัดไป แต่ละบรรทัด เป็นจำนวนเต็มบวก แทนความสูง (หน่วย) ของแท่งสี่เหลี่ยมแต่ละแท่งของ Histogram ตามลำดับ
# ข้อมูลออก
# แสดงขนาดพื้นที่ (ตารางหน่วย) ของรูปสี่เหลี่ยมผื้นผ้าที่มีขนาดใหญ่ที่สุดใน Histogram
# ตัวอย่างข้อมูลออก/ข้อมูลออก
# ข้อมูลเข้า	ข้อมูลออก

                
# 7
# 2
# 1
# 4
# 5
# 1
# 3
# 3
                

            	
                
# 8
                

            

                
# 8
# 4
# 7
# 1
# 4
# 5
# 6
# 4
# 2
                

            	
                
# 16
                

            

                
# 10
# 10
# 10
# 8
# 8
# 5
# 6
# 5
# 7
# 5
# 8
                

            	
                
# 50
                

            

                
# 9
# 17
# 18
# 4
# 22
# 23
# 13
# 12
# 52
# 25
                

            	
                
# 72
                

n = int(input(""))
ls = []
counter = 0

while True:
    if counter >= n:
        break
    
    number = int(input())
    ls.append(number)
    
    counter += 1

minNumber = min(ls)
maxNumber = max(ls)

maxCounter = 0
maxBase = 0
maxTotal = 0

for i in range(minNumber, maxNumber + 1):
    counter = 0
    for j in ls:
        if i <= j:
            counter += 1
        else:
            counter = 0

            total = counter * i
            if total > maxTotal:
                maxTotal = total    

        total = counter * i
        if total > maxTotal:
            maxTotal = total

print (maxTotal)